
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	Имя = ?(ПустаяСтрока(ИмяПользователя()), "НеАвторизован",ИмяПользователя());
	НайденныйПользователь = Справочники.СотрудникиПредприятия.НайтиПоНаименованию(Имя, Истина);
	ЕСЛИ НайденныйПользователь.Пустая()  ТОГДА
		
		НовыйПользователь = Справочники.СотрудникиПредприятия.СоздатьЭлемент() ;
		НовыйПользователь.Наименование = Имя;
		НовыйПользователь.Записать();
		НайденныйПользователь = НовыйПользователь.Ссылка;
		
	КОНЕЦЕСЛИ;
	
	ПараметрыСеанса.ТекущийПользователь = НайденныйПользователь;
КонецПроцедуры
   
Процедура ЗаписатьНовогоПользователя(НовыйПользователь) Экспорт
      

      // Проверить наличие роли Администратор у нового пользователя.
РольАдминистратор = Метаданные.Роли.Администратор;
      
Если НовыйПользователь.Роли.Содержит(РольАдминистратор) Тогда
      Сообщить("Добавление пользователя с административными правами запрещено");
      Иначе // у нового пользователя нет роли Администратор
		  // Проверить, что текущий пользователь обладает правами  Администратора.
          Если РольДоступна(РольАдминистратор)  Тогда
     // Выполнить запись нового пользователя.
              НовыйПользователь.Записать()
		  Иначе
			  Сообщить("Недостаточно прав доступа для добавления пользователя");
         КонецЕсли;
      

      
КонецЕсли;
      
КонецПроцедуры
       