
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр НазначенныйБонусСотруднику
	Движения.НазначенныйБонусСотруднику.Записывать = Истина;
	Движение = Движения.НазначенныйБонусСотруднику.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Бонусы = Бонус;
	Движение.СтатусБонусов = Перечисления.СтатусНазначаемогоБонуса.Завершен;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
